[
    {
        "title": "TruBlu",
        "description": "Revolutionize your college tour experience with TruBlu, a platform that matches students with personalized tour guides based on interests and goals.",
        "long_text": "TruBlu is a groundbreaking web-based application that revolutionizes the traditional college campus tour into a transformative and insightful journey. Tailored specifically for prospective students, TruBlu offers a unique matching system that pairs individuals with tour guides based on shared interests, academic focuses, and extracurricular activities. This one-on-one approach ensures that each tour is personalized and deeply informative, providing a real sense of what life at the campus is like.",
        "key_features": [
            [
                "User Authentication",
                "Utilizes Python's Hashlib and UUID for secure password hashing and user authentication, ensuring a safe user experience with secure sign-up and login processes."
            ],
            [
                "Profile Customization",
                "Allows users to create detailed profiles using Flask's render_template for dynamic content delivery, enhancing the matching process with tour guides."
            ],
            [
                "Advanced Search Functionality",
                "Employs Flask to manage HTTP requests and responses efficiently. This enables users to search for guides based on various criteria, making it easy to find the perfect match."
            ],
            [
                "Intelligent Recommendation Engine",
                "Utilizes user preferences to suggest the most suitable guides, ensuring relevant and meaningful connections. This feature is enhanced by the backend technologies (Flask and SQLite), which handle data management and logic processing."
            ],
            [
                "Session Management",
                "Uses Flask sessions to maintain user states across the web application, ensuring a seamless user experience."
            ],
            [
                "Front-End Development",
                "Developed using HTML and CSS, it provides a clean and user-friendly interface. Flask's render_template supports this, helping to return HTML files dynamically based on user interactions."
            ]
        ],
        "youtube_video": "https://www.youtube.com/embed/U9dl5rsrCug?si=5VxHEO0HmcPqHNEF",
        "technologies": [
            "Flask",
            "SQLite",
            "Python",
            "HTML",
            "CSS",
            "Hashlib",
            "UUID"
        ],
        "link": "https://github.com/jjspill/truBlu/"
    }
]